app/controllers/produtos_controller.rb

	def index
		@produtos_por_nome = Produto.order(:nome).limit 5
		@produtos_por_preco = Produto.order(:preco).limit 2
---
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 5
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC LIMIT 2

	def busca
		@nome_a_buscar = params[:nome]
		@produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%bang%')

	def update
		if @produto.update produto_params
---
UPDATE "produtos" SET "descricao" = ?, "departamento_id" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["descricao", "blusa para jogar xadrez"], ["departamento_id", 1], ["updated_at", "2016-09-05 23:55:53.651429"], ["id", 11]]

	def create
		@produto = Produto.new produto_params
		if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "qunatidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "calca azul"], ["descricao", "calça azul muito bonita"], ["qunatidade", 20], ["preco", 30.99], ["created_at", "2016-09-02 00:21:58.638544"], ["updated_at", "2016-09-02 00:21:58.638544"]]

	def set_produto
		id = params[:id]
		Produto.find(id)
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 11]]